tutorials/incompressible/pimpleFoam/t-junction/constant/polyMesh/blockMeshDict
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//           outlet1
//             +-+
//             | |
//             | |
//             | |
//             | |
// +-----------+ |
// |inlet        |
// +-----------+ |
//             | |
//             | |
//             | |
//             | |
//             +-+
//           outlet2

convertToMeters 1;

vertices        
(
    (0.0  -0.01 0)   //0
    (0.2  -0.01 0)
    (0.2   0.01 0)   //2
    (0.0   0.01 0)

    (0.22 -0.01 0)  //4
    (0.22  0.01 0)

    (0.2  -0.21 0)  //6
    (0.22 -0.21 0)

    (0.2   0.21 0)  //8
    (0.22  0.21 0)

    // Z
    (0.0  -0.01 0.02)   //0
    (0.2  -0.01 0.02)
    (0.2   0.01 0.02)   //2
    (0.0   0.01 0.02)

    (0.22 -0.01 0.02)  //4
    (0.22  0.01 0.02)

    (0.2  -0.21 0.02)  //6
    (0.22 -0.21 0.02)

    (0.2   0.21 0.02)  //8
    (0.22  0.21 0.02)

);

blocks          
(
    // inlet block
    hex (0 1 2 3  10 11 12 13) (50 5 5) simpleGrading (1 1 1)

    // central block
    hex (1 4 5 2  11 14 15 12) (5 5 5) simpleGrading (1 1 1)

    // bottom block
    hex (6 7 4 1  16 17 14 11) (5 50 5) simpleGrading (1 1 1)

    // top block
    hex (2 5 9 8  12 15 19 18) (5 50 5) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet
    (
        (0 10 13 3)
    )

    patch outlet1
    (
        (6 7 17 16)
    )

    patch outlet2
    (
        (8 18 19 9)
    )
);

mergePatchPairs
(
);

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
