tutorials/incompressible/pimpleFoam/t-junction/constant/polyMesh/boundary
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       10050;
    }
    outlet1
    {
        type            patch;
        nFaces          25;
        startFace       10075;
    }
    outlet2
    {
        type            patch;
        nFaces          25;
        startFace       10100;
    }
    defaultFaces
    {
        type            wall;
        nFaces          3075;
        startFace       10125;
    }
)

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
